doc/open-api-client/Service References/OpenApiMessageConsumerServiceReference/OpenApiMessageConsumerService.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="urn://x-artefacts-gnivc-ru/inplat/servin/OpenApiMessageConsumerService/1.0" xmlns:ns1="urn://x-artefacts-gnivc-ru/inplat/servin/OpenApiMessageConsumerService/types/1.0" name="OpenApiMessageConsumerService" targetNamespace="urn://x-artefacts-gnivc-ru/inplat/servin/OpenApiMessageConsumerService/1.0" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xs:schema xmlns:tns="urn://x-artefacts-gnivc-ru/inplat/servin/OpenApiMessageConsumerService/types/1.0" elementFormDefault="qualified" targetNamespace="urn://x-artefacts-gnivc-ru/inplat/servin/OpenApiMessageConsumerService/types/1.0" version="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:element name="GetMessageRequest">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="1" maxOccurs="1" name="Message">
              <xs:complexType>
                <xs:sequence>
                  <xs:any namespace="##other" processContents="skip" />
                </xs:sequence>
              </xs:complexType>
            </xs:element>
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="GetMessageResponse">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" maxOccurs="1" name="Message">
              <xs:complexType>
                <xs:sequence>
                  <xs:any namespace="##other" processContents="skip" />
                </xs:sequence>
              </xs:complexType>
            </xs:element>
          </xs:sequence>
        </xs:complexType>
      </xs:element>
    </xs:schema>
  </wsdl:types>
  <wsdl:message name="GetMessageResponse">
    <wsdl:part name="parameters" element="ns1:GetMessageResponse" />
  </wsdl:message>
  <wsdl:message name="GetMessageRequest">
    <wsdl:part name="parameters" element="ns1:GetMessageRequest" />
  </wsdl:message>
  <wsdl:portType name="OpenApiMessageConsumerServicePortType">
    <wsdl:operation name="GetMessage">
      <wsdl:input name="GetMessageRequest" message="tns:GetMessageRequest" />
      <wsdl:output name="GetMessageResponse" message="tns:GetMessageResponse" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="OpenApiMessageConsumerServiceSoapBinding" type="tns:OpenApiMessageConsumerServicePortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="GetMessage">
      <soap:operation soapAction="urn:GetMessageRequest" style="document" />
      <wsdl:input name="GetMessageRequest">
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output name="GetMessageResponse">
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="OpenApiMessageConsumerService">
    <wsdl:port name="OpenApiMessageConsumerServiceEndpoint" binding="tns:OpenApiMessageConsumerServiceSoapBinding">
      <soap:address location="http://server:port/open-api/system/subsystem/external_system_namespace" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>